app/controllers/reports_controller.rb

    def show
        @report = Report.find(params[:id])
---
SELECT  "reports".* FROM "reports" WHERE "reports"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def create
        report = Report.create(report_params)
        report[:grade] = report.test_grade
        report.save
---
INSERT INTO "reports" ("test_session_id", "grade", "improvements") VALUES (?, ?, ?)  [["test_session_id", 1], ["grade", 100], ["improvements", "Speed, accuracy"]]
INSERT INTO "tests" ("name", "content", "language", "difficulty") VALUES (?, ?, ?, ?)
UPDATE "reports" SET "grade" = ? WHERE "reports"."id" = ?  [["grade", 0], ["id", 3]]