app/controllers/tests_controller.rb

SELECT "tests".* FROM "tests"
---
    def index
        @tests = Test.all

SELECT  "tests".* FROM "tests" WHERE "tests"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def show
        @test = Test.find(params[:id])