app/controllers/test_sessions_controller.rb

INSERT INTO "test_sessions" ("user_id", "test_id") VALUES (?, ?)  [["user_id", 1], ["test_id", 2]]
UPDATE "test_sessions" SET "start_time" = ? WHERE "test_sessions"."id" = ?  [["start_time", "2019-12-24 16:44:46.227025"], ["id", 3]]
---
    def create
        test_session = TestSession.create(test_session_params)
        test_session[:start_time] = test_session.test_time_track
        test_session.save

SELECT  "test_sessions".* FROM "test_sessions" WHERE "test_sessions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def show
        @test_session = TestSession.find(params[:id])

SELECT  "test_sessions".* FROM "test_sessions" WHERE "test_sessions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "test_sessions" SET "end_time" = ? WHERE "test_sessions"."id" = ?  [["end_time", "2019-12-24 17:43:05.767403"], ["id", 4]]
---
    def update
        test_session = TestSession.find(params[:id])
        test_session.update(test_session_params)

SELECT  "test_sessions".* FROM "test_sessions" WHERE "test_sessions"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
---
    def test_complete
        @test_session = TestSession.find(params[:id])