app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("username", "password_digest", "first_name", "last_name", "age") VALUES (?, ?, ?, ?, ?)  [["username", "TestingUser"], ["password_digest", "$2a$12$LWuzrrX9PYZ73gRvBPZStu8lgvdQu2.BE6xzMkddjME.BQqlyrFL6"], ["first_name", "TestUser"], ["last_name", "TestUser"], ["age", 22]]